IdeaRS.Connections
EndPlateDataBase Properties
Compatible with IDEA StatiCa 0.0
The EndPlateDataBase type exposes the following members.
Properties
Name | Description
ConnectionType
 Gets or sets the type of connection of two parts.
InnerRadius
 Gets or sets the inner radius of the circular plate boundary.
IsActive |  (Inherited from ConnectionCmdData.)
Name
 Gets or set the name
 (Inherited from ConnectionCmdData.)
OffsetBottom
 Gets or sets the bottom offset of the end plate boundary in the horizontal direction (the width of the plate). The size of the end plate is based on the circumscribed box of the column.
OffsetLeft
 Gets or sets the left offset of the end plate boundary in the vertical direction (the height of the plate). The size of the end plate is based on the circumscribed box of the column.
OffsetRight
 Gets or sets the right offset of the end plate boundary in the vertical direction (the height of the plate). The size of the end plate is based on the circumscribed box of the column.
OffsetTop
 Gets or sets the top offset of the end plate boundary in the horizontal direction (the width of the plate). The size of the end plate is based on the circumscribed box of the column.
OperationId
 Gets or sets the identifier of the operation in the manufacturer sequence
 (Inherited from ConnectionCmdData.)
OuterRadius
 Gets or sets the outer radius of the circular plate boundary.
PlateMaterialName
 Gets or sets the name of the material If value is null or empty material is taken from column
 (Inherited from PlateDataBase.)
PlateSizeMethod
 Gets or sets the method of the definition of dimensions of the plate
ShapeData
 Collection of plate editor data
 (Inherited from PlateDataBase.)
Thickness
 Gets or sets the thickness of the plate
 (Inherited from PlateDataBase.)
Top
See Also
Reference
EndPlateDataBase Class
IdeaRS.Connections.Data Namespace